Tekla Open API Reference for Tekla Structures 2025
CatalogHandler.GetParametricProfileItems Method
 Returns an enumerator of parametric profile items.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ProfileItemEnumerator GetParametricProfileItems()
Public Function GetParametricProfileItems As ProfileItemEnumerator
Return Value
Type: ProfileItemEnumerator
A ProfileItemEnumerator of parametric profile items.
See Also
Reference
CatalogHandler Class
Tekla.Structures.Catalogs Namespace